books/BasicProofThery.org


#+TITLE: Basic Proof Theory
#+AUTHOR: A. S. Troelstra and H. Schwichtenberg

#+LATEX_HEADER: \input{preamble.tex}
#+EXPORT_FILE_NAME: ../latex/BasicProofTheory/BasicProofTheory.tex

* Introduction
