latex/BasicProofTheory/BasicProofTheory.tex
% Created 2019-12-27 五 22:22
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{minted}
\input{preamble.tex}
\author{A. S. Troelstra and H. Schwichtenberg}
\date{\today}
\title{Basic Proof Theory}
\hypersetup{
 pdfauthor={A. S. Troelstra and H. Schwichtenberg},
 pdftitle={Basic Proof Theory},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 26.3 (Org mode 9.3)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents \clearpage
